tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# Mac Apple Store CLI
brew "mas"
# Git
brew "git"
# Zsh shell
brew "zsh"
# Run your GitHub Actions locally 🚀
brew "act"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Utility for easily assuming AWS IAM roles from the command-line
brew "awsume"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Terraform
brew "hashicorp/tap/terraform"
# Web debugging Proxy application
cask "charles"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
cask "lens"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
