tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "FelixKratz/formulae"
tap "jesseduffield/lazygit"
tap "khanhas/tap"

# exa
brew "exa"
# lazygit
brew "lazygit"
# ripgrep
brew "ripgrep"
# fzf
brew "fzf"
# zplug (like vimplug but for zsh)
brew "zplug"
# Mac Apple Store CLI
brew "mas"
# Git
brew "git"
# Run your GitHub Actions locally 🚀
brew "act"
# Utility for easily assuming AWS IAM roles from the command-line
brew "awsume"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Terraform
brew "hashicorp/tap/terraform"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# JetBrainsMono
cask "font-jetbrains-mono-nerd-font"
